results/2vcpu-8gb.stock.run-1.pgbench.output
pgbench (14.1, server 14.2)
starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1000
query mode: simple
number of clients: 20
number of threads: 2
duration: 300 s
number of transactions actually processed: 111004
latency average = 54.111 ms
initial connection time = 140.089 ms
tps = 369.609508 (without initial connection time)
statement latencies in milliseconds:
         0.003  \set aid random(1, 100000 * :scale)
         0.002  \set bid random(1, 1 * :scale)
         0.002  \set tid random(1, 10 * :scale)
         0.002  \set delta random(-5000, 5000)
         1.338  BEGIN;
        10.759  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         1.459  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         3.626  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         3.018  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         3.707  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        30.158  END;