results/2vcpu-8gb.stock.run-2.pgbench.output
pgbench (14.1, server 14.2)
starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1000
query mode: simple
number of clients: 20
number of threads: 2
duration: 300 s
number of transactions actually processed: 114958
latency average = 52.173 ms
initial connection time = 140.518 ms
tps = 383.341662 (without initial connection time)
statement latencies in milliseconds:
         0.003  \set aid random(1, 100000 * :scale)
         0.002  \set bid random(1, 1 * :scale)
         0.002  \set tid random(1, 10 * :scale)
         0.002  \set delta random(-5000, 5000)
         1.403  BEGIN;
        11.394  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         1.424  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         3.041  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         2.617  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         3.154  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        29.102  END;