results/2vcpu-8gb.stock.run-3.pgbench.output
pgbench (14.1, server 14.2)
starting vacuum...end.
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1000
query mode: simple
number of clients: 20
number of threads: 2
duration: 300 s
number of transactions actually processed: 111547
latency average = 53.778 ms
initial connection time = 134.542 ms
tps = 371.896436 (without initial connection time)
statement latencies in milliseconds:
         0.004  \set aid random(1, 100000 * :scale)
         0.003  \set bid random(1, 1 * :scale)
         0.002  \set tid random(1, 10 * :scale)
         0.002  \set delta random(-5000, 5000)
         1.293  BEGIN;
        11.117  UPDATE pgbench_accounts SET abalance = abalance + :delta WHERE aid = :aid;
         1.372  SELECT abalance FROM pgbench_accounts WHERE aid = :aid;
         3.505  UPDATE pgbench_tellers SET tbalance = tbalance + :delta WHERE tid = :tid;
         2.879  UPDATE pgbench_branches SET bbalance = bbalance + :delta WHERE bid = :bid;
         3.527  INSERT INTO pgbench_history (tid, bid, aid, delta, mtime) VALUES (:tid, :bid, :aid, :delta, CURRENT_TIMESTAMP);
        30.021  END;